IDENTIFICATION DIVISION.
PROGRAM-ID. WRITE-DATA.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT OUTPUT-FILE ASSIGN TO OUTDD
        ORGANIZATION IS SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD  OUTPUT-FILE.
01  OUTPUT-RECORD                 PIC X(80).

PROCEDURE DIVISION.
    OPEN OUTPUT OUTPUT-FILE
    MOVE "DATA AUTOMATICALLY WRITTEN VIA JCL ALLOCATION." TO OUTPUT-RECORD
    WRITE OUTPUT-RECORD
    CLOSE OUTPUT-FILE
    GOBACK.
